import random
import time
import os

min_health = 0
max_health = 20
player_health = max_health
bot_health = max_health

spells = [ ['fireball', 10, 0], ['metabolism', 0, 8], ['silence', 0, 0], ['lightfly', 3, 0] ]
complicated_spells = [ ['strength', 9, 3], ['vitality', 4, 8], ['ignimag', 3, 1 ] ]

name = 0
damage = 1
heal = 2

# ASCII графика
start_ascii = '''
                                ______ ________  ______  _______ ________
                               /      |        \/      \|       |        |
                              |  $$$$$$\$$$$$$$|  $$$$$$| $$$$$$$\$$$$$$$$
                              | $$___\$$ | $$  | $$__| $| $$__| $$ | $$
                               _\$$$$$$\ | $$  | $$$$$$$| $$$$$$$\ | $$
                               \$$    $$ | $$  | $$  | $| $$  | $$ | $$
                                \$$$$$$   \$$   \$$   \$$\$$   \$$  \$$
 __       __ ______ ________  ______  _______  _______         _______  __    __ ________ __      ____
|  \  _  |  |      |        \/      \|       \|       \       |       \|  \  |  |        |  \    /    |
| $$ / \ | $$\$$$$$$\$$$$$$$|  $$$$$$| $$$$$$$| $$$$$$$\      | $$$$$$$| $$  | $| $$$$$$$| $$   |  $$$$|
| $$/  $\| $$ | $$     /  $$| $$__| $| $$__| $| $$  | $$      | $$  | $| $$  | $| $$__   | $$    \$$| $$
| $$ $$\$$\$$ | $$   /  $$  | $$$$$$$| $$$$$$$| $$  | $$      | $$  | $| $$  | $| $$$$$  | $$     |  $$
| $$$    \$$|   $$ |  $$    | $$  | $| $$  | $| $$    $$      | $$    $$\$$    $| $$     | $$     |  $|
 \$$      \$$\$$$$$$\$$$$$$$$\$$   \$$\$$   \$$\$$$$$$$        \$$$$$$$  \$$$$$$ \$$$$$$$$\$$$$$$$$\$$
'''
gameover_ascii = '''
 ______   ______  __       __ ________         ______  __     __ ________ _______
 /      \ /      \|  \     /  |        \       /      \|  \   |  |        |       |
|  $$$$$$|  $$$$$$| $$\   /  $| $$$$$$$$      |  $$$$$$| $$   | $| $$$$$$$| $$$$$$$|
| $$|    | $$    $| $$$$\  $$$| $$  \         | $$  | $$\$$\ /  $| $$  \  | $$    $$
| $$ \$$$| $$$$$$$| $$\$$ $$ $| $$$$$         | $$  | $$ \$$\  $$| $$$$$  | $$$$$$$|
| $$__| $| $$  | $| $$ \$$$| $| $$_____       | $$__/ $$  \$$ $$ | $$_____| $$  | $$
  \$$$$$$ \$$   \$$\$$      \$$\$$$$$$$$        \$$$$$$     \$    \$$$$$$$$\$$   \$$
'''
end_ascii = '''
 ________ __    __ ________        ________ __    __ _______
|        |  \  |  |        \      |        |  \  |  |       |
 \$$$$$$$| $$  | $| $$$$$$$$      | $$$$$$$| $$\ | $| $$$$$$$|
   | $$  | $$    $| $$  \         | $$  \  | $$$$\ $| $$  | $$
   | $$  | $$$$$$$| $$$$$         | $$$$$  | $$\$$ $| $$  | $$
   | $$  | $$  | $| $$_____       | $$_____| $$ \$$$| $$__/ $$
    \$$   \$$   \$$\$$$$$$$$       \$$$$$$$$\$$   \$$\$$$$$$$
'''

level_up_ascii = '''
 __       ________ __     __ ________ __              __    __ _______
|  \     |        |  \   |  |        |  \            |  \  |  |       \|
| $$     | $$$$$$$| $$   | $| $$$$$$$| $$            | $$  | $| $$$$$$$|
| $$     | $$  \   \$$\ /  $| $$  \  | $$            | $$  | $| $$    $$
| $$     | $$$$$    \$$\  $$| $$$$$  | $$            | $$  | $| $$$$$$$
| $$_____| $$_____   \$$ $$ | $$_____| $$_____       | $$__/ $| $$
 \$$$$$$$$\$$$$$$$$    \$    \$$$$$$$$\$$$$$$$$        \$$$$$$ \$$
'''

new_round = '''
....__.............................@......
..._##_............................._##_...
...##|_..............................###...
.._##._####.........#.#........_####__##_..
...###.####...._###-...|###_..._####_##@_..
..._@###____####._.......__####__._###_....
.....########._.............._########_....
.._######__......................_######_..
_####_.$####$................_#####-._####.
_##......._###_.............-###_.......##_
_##........._##@._......._.###........._##_
####........._####.......####..........####
...........................................
'''

win = '''
##########################################
################_||||#||||_###############
###########|||||||||||||||||||||##########
##########$|||||||||||||||||||||$#########
######|||||||||||||||||||||||||||||||#####
######|||||||||__-$$$$$$$$$$|||||||||#####
##$||||||||$|||$$$$$$$$$$$$$|||$||||||||##
###|||||||||$|||$$$$$$$$$$$@||$|||||||||##
####|||||||||$$||$$$$$$$$$|||$|||||||||###
#$||||||||||||||$$$$$$$$$$$@|||||||||||||#
#||||||||||||||||||$$$$$|||||||||||||||||@
###|||||||||||||||||$$$$|||||||||||||||@##
##|||||||||||||||||$$$$$||||||||||||||||$#
#||||||||||||||||||$$$$$$||||||||||||||||@
####-||||||||||||$$$$$$$$$||||||||||||-###
####|||||||||||||$$$$$$$$$||||||||||||-###
####|||||||||||||$$$$$$$$$|||||||||||||###
########||||||||@@||@@@@@@@||||||||#######
########||||||||||||||||||||||||||$#######
#############||||||||||||||||$############
##############||###$|||###$||#############
'''

# -------------- СТАРТ -------------------
while True:
    # Выбор игрока
    print(start_ascii, '\nНачать волшебную дуэль?\n[1] - Да\n[0] - Нет')
    select  = input("Ваш выбор: ")
    if (select == '0') :
        break
    elif not select == '1':
        print("Ошибка! Попробуй снова!")
    else:
        # Начало новой игры
        os.system('cls')
        current_spells = spells
        a = len(spells)
        del current_spells[a:]
        print('''\n==============================================
================= ПАРАМЕТРЫ ==================
         Заклинание     Урон   Лечение''')
        i = 1
        for row in current_spells:
            print(f"\n{[i]}", end=' - ')
            i = i + 1
            for elem in row:
                print('\t', elem, end='')

        print('\n===============================================')
        print('------------ ВОЛШЕБНАЯ ДУЭЛЬ ------------------')
        for round in range(1, 6):
            choice = True
            while choice:
                player_select = input('\nВыбери заклинание: ')
                if player_select > '0' and player_select <= str(len(current_spells)):
                    player_select = int(player_select)
                    player_select = player_select - 1
                    bot_select = random.randint(0, len(current_spells) - 1)
                    choice = False
                else:
                    print('Ошибка! Попробуй ещё раз!')
            play_1 = current_spells[player_select][name]    # Выбор оружия игрока
            play_2 = current_spells[bot_select][name]       # Выбор оружия бота
            print(f'''--------- РАУНД № {round} ---------
 {play_1.upper()}  ---- {play_2.upper()}''')

            # Применение заклинаний
            if play_1 == 'silence' and play_2 == 'silence':
                continue
            elif play_1 == 'silence':
                player_select = bot_select
                player_health = player_health + current_spells[bot_select][damage]
            elif play_2 == 'silence':
                bot_select = player_select
                bot_health = bot_health + current_spells[player_select][heal]
            # Расчет здоровья
            player_health = player_health + current_spells[player_select][heal]
            player_health = player_health - current_spells[bot_select][damage]
            bot_health = bot_health + current_spells[bot_select][heal]
            bot_health = bot_health - current_spells[player_select][damage]

            # Максимаьное и минимальное здорьвье
            if player_health > max_health and bot_health > max_health:
                player_health = max_health
                bot_health = max_health
            elif player_health > max_health:
                player_health = max_health
            elif bot_health > max_health:
                bot_health = max_health


            print(f'''ИГРОК против БОТ
 {player_health} \t\t {bot_health}''')
            if player_health < min_health or bot_health < min_health:
                break;
            time.sleep(3)
            # Дополнительная магия
            # Переход на следующий уровень

            if round == 3:
                os.system('cls')
                print(f'''
                {level_up_ascii}
                ==============================================================
                ===================== НОВЫЕ ВОЗМОЖНОСТИ ======================
                    Магия       Урон    Лечение''')
                current_spells = current_spells + complicated_spells
                count = 1
                for row in current_spells:
                    print(f'\n{[count]}', end = ' - ')
                    count += 1
                    for elem in row:
                        print('\t', elem, end='')
                print('\n============================================================')

        # Конец игры
        os.system('cls')
        print(gameover_ascii)
        print('''
        =============================================
        ================= КОНЕЦ ИГРЫ ================
        ''')
        if player_health > bot_health:
            print('Поздравляем! Вы ПОБЕДИЛИ!!!')
        elif player_health < bot_health:
            print("Извини... Ты проиграл!")
        else:
            print("НИЧЬЯ!")
        time.sleep(5)
        print(win, '\n================================================')
os.system('cls')
print(end_ascii)
